### Pandas Seriler

In [1]:
import pandas as pd

In [31]:
seri = pd.Series([1,2,3,4,5,6])

In [32]:
seri #index değerleri verdi (0-5)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [4]:
seri.index

RangeIndex(start=0, stop=6, step=1)

In [5]:
seri.values

array([1, 2, 3, 4, 5, 6], dtype=int64)

In [7]:
seri.size

6

In [9]:
a = pd.Series([1,2,3,4], index = ["a", "b", "c", "d"])

In [10]:
a

a    1
b    2
c    3
d    4
dtype: int64

In [11]:
a[0:2]

a    1
b    2
dtype: int64

### İki Seriyi Birleştirme

In [17]:
pd.concat([a,a])

a    1
b    2
c    3
d    4
a    1
b    2
c    3
d    4
dtype: int64

#### Eleman İşlemleri

In [19]:
import numpy as np
b = np.array([1,2,3,4])

In [29]:
seri = pd.Series(b) #array ile seri oluşturmak

In [21]:
seri

0    1
1    2
2    3
3    4
dtype: int32

In [22]:
seri[0]

1

In [23]:
seri[3]

4

In [27]:
5 in seri #Seri içerisinde "5" elemanı var mı?

False

In [26]:
2 in seri

True

### Pandas Dataframe

In [33]:
m = np.array([1,2,3,4,5])

In [36]:
df = pd.DataFrame(m, columns = ["deg1"])

In [37]:
df

   deg1
0     1
1     2
2     3
3     4
4     5

In [39]:
k = np.arange(16).reshape(4,4)

In [43]:
df2 = pd.DataFrame(k, columns = ["a","b", "c", "d"])

In [44]:
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [46]:
df.size

5

In [47]:
df2.shape

(4, 4)

In [48]:
df2.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

### Eleman İşlemleri

In [56]:
df2[0:2]

   a  b  c  d
0  0  1  2  3
1  4  5  6  7

In [53]:
df[0:3]

   deg1
0     1
1     2
2     3

In [57]:
df2[0:2]["c"]

0    2
1    6
Name: c, dtype: int32

### Silme

In [60]:
df2.drop("a", axis = 1)

    b   c   d
0   1   2   3
1   5   6   7
2   9  10  11
3  13  14  15

In [62]:
df2 #a sütunu var bunu önlemek için inplace kullanılır.

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [63]:
df2.drop("a",axis =1, inplace = True)

In [64]:
df2

    b   c   d
0   1   2   3
1   5   6   7
2   9  10  11
3  13  14  15

In [65]:
"b" in df2

True

In [67]:
df2["e"] = df2["b"] + df2["c"]

In [69]:
df2

    b   c   d   e
0   1   2   3   3
1   5   6   7  11
2   9  10  11  19
3  13  14  15  27

#### Gözlem ve Değişken Seçimi

In [70]:
df

   deg1
0     1
1     2
2     3
3     4
4     5

In [71]:
df2

    b   c   d   e
0   1   2   3   3
1   5   6   7  11
2   9  10  11  19
3  13  14  15  27

In [75]:
df.iloc[0:3] #indexlere bağlı kalmak

   deg1
0     1
1     2
2     3

In [76]:
df.loc[0:3] #lokasyona bağlı kalmak

   deg1
0     1
1     2
2     3
3     4

In [77]:
df2.iloc[0:2, "d"] #hata alınır çünkü index mantığı ile hareket eder.

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [80]:
df2.iloc[0:3]["d"]

0     3
1     7
2    11
Name: d, dtype: int32

In [82]:
df2.loc[0:3, "d"] #lokasyona bağlı olduğu için hata vermez

0     3
1     7
2    11
3    15
Name: d, dtype: int32

#### Koşullu Eleman İşlemleri

In [83]:
df2

    b   c   d   e
0   1   2   3   3
1   5   6   7  11
2   9  10  11  19
3  13  14  15  27

In [84]:
df2[df2.e>5]

    b   c   d   e
1   5   6   7  11
2   9  10  11  19
3  13  14  15  27

In [86]:
df2[(df2.e>5) & (df2.b>5)]

    b   c   d   e
2   9  10  11  19
3  13  14  15  27

#### Birleştirme (join) İşlemleri

In [91]:
df

   deg1
0     1
1     2
2     3
3     4
4     5

In [97]:
m =  np.arange(16).reshape(4,4)

In [101]:
df3 = pd.DataFrame(m, columns =["deg1","deg2","deg3","deg4"])

In [102]:
df3

   deg1  deg2  deg3  deg4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15

In [103]:
pd.concat([df,df3])

   deg1  deg2  deg3  deg4
0     1   NaN   NaN   NaN
1     2   NaN   NaN   NaN
2     3   NaN   NaN   NaN
3     4   NaN   NaN   NaN
4     5   NaN   NaN   NaN
0     0   1.0   2.0   3.0
1     4   5.0   6.0   7.0
2     8   9.0  10.0  11.0
3    12  13.0  14.0  15.0

In [105]:
pd.concat([df,df3], ignore_index = True,join = "inner" ) #join = inner ortak olan sütuna göre birleştirdik.

   deg1
0     1
1     2
2     3
3     4
4     5
5     0
6     4
7     8
8    12